### LOAD THE DATASET AND DISPLAY ITS SHAPE,COLUMNS AND DATATYPES

In [10]:
#loading the dataset
import pandas as pd
import numpy as np
df=pd.read_csv("task_dataset.csv")
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,user_0,-5,₹50000,HR,2020/12/01,DELHI,3,five,True
1,U1001,30,45000,Finance,15/02/2021,Delhi,3,1,yes
2,U1002,30,25000,HR,NaN,Delhi,excellent,10,False
3,NaN,unknown,NaN,HR,invalid,Hyderabad,excellent,5,yes
4,NaN,NaN,120000.75,IT,NaN,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60,₹50000,HR,15/02/2021,DELHI,2,five,NaN
996,U1996,NaN,NaN,IT,15/02/2021,Mumbai,NaN,5,no
997,user_997,unknown,25000,HR,invalid,Mumbai,3,5,True
998,U1998,-5,25000,NaN,15/02/2021,Bangalore,1,0,True
999,NaN,30,45000,HR,2022-01-15,Hyderabad,excellent,five,no

In [11]:
df.shape

(1000, 9)

In [12]:
df.columns

Index(['user_id', 'age', 'salary', 'department', 'join_date', 'city',
       'performance_score', 'experience_years', 'is_active'],
      dtype='object')

In [13]:
df.dtypes

user_id              object
age                  object
salary               object
department           object
join_date            object
city                 object
performance_score    object
experience_years     object
is_active            object
dtype: object

### CALCULATE THE PERCENTAGE OF MISSING VALUES FOR EACH COLUMN

In [14]:
((df.isnull().sum())/1000)*100

user_id              51.0
age                  11.4
salary               31.1
department           14.1
join_date            21.9
city                 14.9
performance_score    10.1
experience_years     12.7
is_active            20.0
dtype: float64

### IDENTIFY COLUMNS CONTAINING MIXED DATA TYPES

In [15]:
df.apply(lambda col:col.map(type).nunique())

user_id              2
age                  2
salary               2
department           2
join_date            2
city                 2
performance_score    2
experience_years     2
is_active            2
dtype: int64

### CLEAN USER ID BY REPLACING EMPTY STRING BY NaN AND CONVERTING VALUES TO UPPERCASE

In [16]:
df["user_id"].fillna("NaN",inplace=True)
df["user_id"]=df["user_id"].str.upper()
df

C:\Users\91998\AppData\Local\Temp\ipykernel_28884\3386418413.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["user_id"].fillna("NaN",inplace=True)

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,USER_0,-5,₹50000,HR,2020/12/01,DELHI,3,five,True
1,U1001,30,45000,Finance,15/02/2021,Delhi,3,1,yes
2,U1002,30,25000,HR,NaN,Delhi,excellent,10,False
3,NAN,unknown,NaN,HR,invalid,Hyderabad,excellent,5,yes
4,NAN,NaN,120000.75,IT,NaN,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NAN,60,₹50000,HR,15/02/2021,DELHI,2,five,NaN
996,U1996,NaN,NaN,IT,15/02/2021,Mumbai,NaN,5,no
997,USER_997,unknown,25000,HR,invalid,Mumbai,3,5,True
998,U1998,-5,25000,NaN,15/02/2021,Bangalore,1,0,True
999,NAN,30,45000,HR,2022-01-15,Hyderabad,excellent,five,no

### CONVERT AGE TO NUMERIC AND REPLACE INVALID VALUES(NEGATIVE OR >100) WITH NaN

In [31]:
df["age"].replace({"unknown":1,np.nan:1},inplace=True)
df["age"]=df["age"].astype('int32')
df["age"]=df["age"].apply(lambda x:np.nan if x>100 or x<0 else x)
df["age"]

C:\Users\91998\AppData\Local\Temp\ipykernel_28884\387503482.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["age"].replace({"unknown":1,np.nan:1},inplace=True)

0       1
1      30
2      30
3       1
4       1
       ..
995    60
996     1
997     1
998     1
999    30
Name: age, Length: 1000, dtype: int64

### CLEAN SALARY BY REMOVING CURRENCY SYMBOLS AND CONVERTING THEM INTO NUMERIC

In [52]:
df["salary"]=df["salary"].astype(str)
df["salary"]=df["salary"].str.replace("₹","",regex=False)
df["salary"]=pd.to_numeric(df["salary"],errors="coerce")
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,USER_0,1,50000.00,HR,2020-01-12,DELHI,3,five,True
1,U1001,30,45000.00,Finance,NaT,Delhi,3,1,yes
2,U1002,30,25000.00,HR,NaT,Delhi,excellent,10,False
3,NAN,1,NaN,HR,NaT,Hyderabad,excellent,5,yes
4,NAN,1,120000.75,IT,NaT,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NAN,60,50000.00,HR,NaT,DELHI,2,five,NaN
996,U1996,1,NaN,IT,NaT,Mumbai,NaN,5,no
997,USER_997,1,25000.00,HR,NaT,Mumbai,3,5,True
998,U1998,1,25000.00,NaN,NaT,Bangalore,1,0,True
999,NAN,30,45000.00,HR,NaT,Hyderabad,excellent,five,no

### CONVERT JOIN_DATE INTO DATETIME FORMAT HANDLING MULTIPLE DATE FORMATS AND EXTRACT JOINING_YEAR FROM THE JOIN_DATE

In [55]:
df["join_date"]=pd.to_datetime(df["join_date"],errors="coerce",dayfirst=True)
df["joining_year"]=df["join_date"].dt.year
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
0,USER_0,1,50000.00,HR,2020-01-12,DELHI,3,five,True,2020.0
1,U1001,30,45000.00,Finance,NaT,Delhi,3,1,yes,NaN
2,U1002,30,25000.00,HR,NaT,Delhi,excellent,10,False,NaN
3,NAN,1,NaN,HR,NaT,Hyderabad,excellent,5,yes,NaN
4,NAN,1,120000.75,IT,NaT,DELHI,NaN,-1,False,NaN
...,...,...,...,...,...,...,...,...,...,...
995,NAN,60,50000.00,HR,NaT,DELHI,2,five,NaN,NaN
996,U1996,1,NaN,IT,NaT,Mumbai,NaN,5,no,NaN
997,USER_997,1,25000.00,HR,NaT,Mumbai,3,5,True,NaN
998,U1998,1,25000.00,NaN,NaT,Bangalore,1,0,True,NaN
999,NAN,30,45000.00,HR,NaT,Hyderabad,excellent,five,no,NaN

### STANDARDISE DEPARTMENT BY TRIMMING SPACES AND CONVERTING TO UPPERCASE

In [59]:
df["department"]=df["department"].str.strip()
df["department"]=df["department"].str.upper()
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
0,USER_0,1,50000.00,HR,2020-01-12,DELHI,3,five,True,2020.0
1,U1001,30,45000.00,FINANCE,NaT,Delhi,3,1,yes,NaN
2,U1002,30,25000.00,HR,NaT,Delhi,excellent,10,False,NaN
3,NAN,1,NaN,HR,NaT,Hyderabad,excellent,5,yes,NaN
4,NAN,1,120000.75,IT,NaT,DELHI,NaN,-1,False,NaN
...,...,...,...,...,...,...,...,...,...,...
995,NAN,60,50000.00,HR,NaT,DELHI,2,five,NaN,NaN
996,U1996,1,NaN,IT,NaT,Mumbai,NaN,5,no,NaN
997,USER_997,1,25000.00,HR,NaT,Mumbai,3,5,True,NaN
998,U1998,1,25000.00,NaN,NaT,Bangalore,1,0,True,NaN
999,NAN,30,45000.00,HR,NaT,Hyderabad,excellent,five,no,NaN

### NORMALIZE CITY NAMES TO A CONSISTENT CASE AND SPELLING

In [66]:
df["city"]=df["city"].str.upper()
df["city"]=df["city"].str.title()
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
0,USER_0,1,50000.00,HR,2020-01-12,Delhi,3.0,five,True,2020.0
1,U1001,30,45000.00,FINANCE,NaT,Delhi,3.0,1,yes,NaN
2,U1002,30,25000.00,HR,NaT,Delhi,NaN,10,False,NaN
3,NAN,1,NaN,HR,NaT,Hyderabad,NaN,5,yes,NaN
4,NAN,1,120000.75,IT,NaT,Delhi,NaN,-1,False,NaN
...,...,...,...,...,...,...,...,...,...,...
995,NAN,60,50000.00,HR,NaT,Delhi,2.0,five,NaN,NaN
996,U1996,1,NaN,IT,NaT,Mumbai,NaN,5,no,NaN
997,USER_997,1,25000.00,HR,NaT,Mumbai,3.0,5,True,NaN
998,U1998,1,25000.00,NaN,NaT,Bangalore,1.0,0,True,NaN
999,NAN,30,45000.00,HR,NaT,Hyderabad,NaN,five,no,NaN

### CONVERT PERFORMANCE SCORE INTO NUMERIC BY MAPPING TEXT VALUES TO NUMBER

In [71]:
df["performance_score"]=df["performance_score"].replace({np.nan:0,"excellent":5,"poor":1})
df["performance_score"]=pd.to_numeric(df["performance_score"],errors="coerce")
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
0,USER_0,1,50000.00,HR,2020-01-12,Delhi,3.0,five,True,2020.0
1,U1001,30,45000.00,FINANCE,NaT,Delhi,3.0,1,yes,NaN
2,U1002,30,25000.00,HR,NaT,Delhi,0.0,10,False,NaN
3,NAN,1,NaN,HR,NaT,Hyderabad,0.0,5,yes,NaN
4,NAN,1,120000.75,IT,NaT,Delhi,0.0,-1,False,NaN
...,...,...,...,...,...,...,...,...,...,...
995,NAN,60,50000.00,HR,NaT,Delhi,2.0,five,NaN,NaN
996,U1996,1,NaN,IT,NaT,Mumbai,0.0,5,no,NaN
997,USER_997,1,25000.00,HR,NaT,Mumbai,3.0,5,True,NaN
998,U1998,1,25000.00,NaN,NaT,Bangalore,1.0,0,True,NaN
999,NAN,30,45000.00,HR,NaT,Hyderabad,0.0,five,no,NaN

### CLEAN EXPERIENCE YEARS BY CONVERTING TEXT VALUES TO NUMERIC AND REMOVING NEGATIVE

In [72]:
df["experience_years"].unique()

array(['five', '1', '10', '5', '-1', '0', nan, '3'], dtype=object)

In [74]:
df["experience_years"]=df["experience_years"].replace({"five":5,np.nan:0,-1:0})
df["experience_years"]=pd.to_numeric(df["experience_years"],errors="coerce")
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
0,USER_0,1,50000.00,HR,2020-01-12,Delhi,3.0,5,True,2020.0
1,U1001,30,45000.00,FINANCE,NaT,Delhi,3.0,1,yes,NaN
2,U1002,30,25000.00,HR,NaT,Delhi,0.0,10,False,NaN
3,NAN,1,NaN,HR,NaT,Hyderabad,0.0,5,yes,NaN
4,NAN,1,120000.75,IT,NaT,Delhi,0.0,0,False,NaN
...,...,...,...,...,...,...,...,...,...,...
995,NAN,60,50000.00,HR,NaT,Delhi,2.0,5,NaN,NaN
996,U1996,1,NaN,IT,NaT,Mumbai,0.0,5,no,NaN
997,USER_997,1,25000.00,HR,NaT,Mumbai,3.0,5,True,NaN
998,U1998,1,25000.00,NaN,NaT,Bangalore,1.0,0,True,NaN
999,NAN,30,45000.00,HR,NaT,Hyderabad,0.0,5,no,NaN

### CONVERT IS_ACTIVE VALUES (YES/NO/TRUE/FALSE) INTO BOOLEAN FORMAT

In [75]:
df["is_active"].unique()

array(['True', 'yes', 'False', 'no', nan], dtype=object)

In [79]:
df["is_active"]=df["is_active"].replace({"yes":True,"no":False,np.nan:False})
df["is_active"].astype(bool)

0       True
1       True
2       True
3       True
4       True
       ...
995    False
996    False
997     True
998     True
999    False
Name: is_active, Length: 1000, dtype: bool

### IDENTIFY AND REMOVE DUPLICATE RECORDS BASED ON USER_ID

In [98]:
df.drop_duplicates(subset="user_id")

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
0,USER_0,1,50000.00,HR,2020-01-12,Delhi,3.0,5,True,2020.0
1,U1001,30,45000.00,FINANCE,NaT,Delhi,3.0,1,True,NaN
2,U1002,30,25000.00,HR,NaT,Delhi,0.0,10,False,NaN
3,NAN,1,NaN,HR,NaT,Hyderabad,0.0,5,True,NaN
4,NaN,1,120000.75,IT,NaT,Delhi,0.0,0,False,NaN
...,...,...,...,...,...,...,...,...,...,...
990,U1990,1,NaN,SALES,NaT,Hyderabad,0.0,0,False,NaN
991,U1991,45,NaN,HR,NaT,Mumbai,0.0,0,True,NaN
996,U1996,1,NaN,IT,NaT,Mumbai,0.0,5,False,NaN
997,USER_997,1,25000.00,HR,NaT,Mumbai,3.0,5,True,NaN
998,U1998,1,25000.00,NaN,NaT,Bangalore,1.0,0,True,NaN

### CREATE A CLEAN FINAL DATAFRAME CONTAINING ONLY VALID STANDARDIZED RECORDS

In [99]:
df_final=pd.DataFrame(df)
df_final

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
0,USER_0,1,50000.00,HR,2020-01-12,Delhi,3.0,5,True,2020.0
1,U1001,30,45000.00,FINANCE,NaT,Delhi,3.0,1,True,NaN
2,U1002,30,25000.00,HR,NaT,Delhi,0.0,10,False,NaN
3,NAN,1,NaN,HR,NaT,Hyderabad,0.0,5,True,NaN
4,NaN,1,120000.75,IT,NaT,Delhi,0.0,0,False,NaN
...,...,...,...,...,...,...,...,...,...,...
995,NaN,60,50000.00,HR,NaT,Delhi,2.0,5,False,NaN
996,U1996,1,NaN,IT,NaT,Mumbai,0.0,5,False,NaN
997,USER_997,1,25000.00,HR,NaT,Mumbai,3.0,5,True,NaN
998,U1998,1,25000.00,NaN,NaT,Bangalore,1.0,0,True,NaN
999,NaN,30,45000.00,HR,NaT,Hyderabad,0.0,5,False,NaN